# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-02-26 16:28:57 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TAGS: web(w)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* kryLisp [2/4]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  kryLisp is a simple Lisp interpreter written in Go.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-02-26 Mi 16:28]
   | Headline                             | Time      |           |       |      |      |
   |--------------------------------------+-----------+-----------+-------+------+------|
   | *Total time*                         | *1d 2:33* |           |       |      |      |
   |--------------------------------------+-----------+-----------+-------+------+------|
   | *kryLisp [2/4]*                      | *1d 2:33* |           |       |      |      |
   | \_  /Components [2/4]/               |           | /1d 2:33/ |       |      |      |
   | \_    Parser [1/1]                   |           |           |  5:15 |      |      |
   | \_      Implement lists as proper... |           |           |       | 2:42 |      |
   | \_    Interpreter [1/3]              |           |           | 21:18 |      |      |
   | \_      Environments [1/1]           |           |           |       | 0:56 |      |
   | \_        Stack of nested scopes     |           |           |       |      | 0:56 |
   | \_      Functions [0/0]              |           |           |       | 5:51 |      |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [2/4]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Parser [1/1]
    :LOGBOOK:
    CLOCK: [2025-02-18 Di 14:41]--[2025-02-18 Di 15:03] =>  0:22
    CLOCK: [2025-02-13 Do 14:44]--[2025-02-13 Do 16:55] =>  2:11
    :END:
    I am going to give Participle a try. In a prior attempt I used gocc, but
    ... I wasn't really happy with it, I don't remember why.
    [2025-02-13 Do 15:44]
    After a long period of procrastination and banging my head against the
    desk I have finally started to understand how participle works and how to
    use it, and now that I am over that hump, I have to say it's pretty nice,
    at least so far.
**** DONE Implement lists as proper single-linked lists
     CLOSED: [2025-02-21 Fr 18:24]
     :LOGBOOK:
     CLOCK: [2025-02-21 Fr 17:50]--[2025-02-21 Fr 18:23] =>  0:33
     CLOCK: [2025-02-21 Fr 16:16]--[2025-02-21 Fr 16:21] =>  0:05
     CLOCK: [2025-02-19 Mi 18:37]--[2025-02-19 Mi 19:59] =>  1:22
     CLOCK: [2025-02-18 Di 15:13]--[2025-02-18 Di 15:55] =>  0:42
     :END:
*** Interpreter [1/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-02-25 Di 14:29]--[2025-02-25 Di 14:33] =>  0:04
    CLOCK: [2025-02-24 Mo 22:01]--[2025-02-25 Di 01:50] =>  3:49
    CLOCK: [2025-02-24 Mo 14:25]--[2025-02-24 Mo 14:43] =>  0:18
    CLOCK: [2025-02-23 So 18:22]--[2025-02-23 So 21:34] =>  3:12
    CLOCK: [2025-02-23 So 15:30]--[2025-02-23 So 15:53] =>  0:23
    CLOCK: [2025-02-22 Sa 19:25]--[2025-02-22 Sa 19:47] =>  0:22
    CLOCK: [2025-02-22 Sa 14:25]--[2025-02-22 Sa 15:52] =>  1:27
    CLOCK: [2025-02-21 Fr 19:57]--[2025-02-21 Fr 20:14] =>  0:17
    CLOCK: [2025-02-18 Di 14:36]--[2025-02-18 Di 14:41] =>  0:05
    CLOCK: [2025-02-17 Mo 15:18]--[2025-02-17 Mo 18:02] =>  2:44
    CLOCK: [2025-02-15 Sa 17:34]--[2025-02-15 Sa 18:09] =>  0:35
    CLOCK: [2025-02-15 Sa 15:21]--[2025-02-15 Sa 16:36] =>  1:15
    :END:
**** Environments [1/1]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
***** DONE Stack of nested scopes
      CLOSED: [2025-02-25 Di 17:37]
      :LOGBOOK:
      CLOCK: [2025-02-25 Di 14:35]--[2025-02-25 Di 15:31] =>  0:56
      :END:
**** TODO Functions [0/0]
     :LOGBOOK:
     CLOCK: [2025-02-25 Di 17:37]--[2025-02-25 Di 21:45] =>  4:08
     CLOCK: [2025-02-24 Mo 20:35]--[2025-02-24 Mo 21:42] =>  1:07
     CLOCK: [2025-02-24 Mo 19:50]--[2025-02-24 Mo 20:26] =>  0:36
     :END:
     I should probably think about how to deal with functions. A plain lambda
     list would be easy, but probably stupidly inefficient.
**** TODO Preamble [0/0]
     I should start writing a set of basic functions and maybe macros to
     define a kind of standard library.
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
